openfoam2206/tutorials/lagrangian/reactingParcelFoam/liquidFilmStepWithSprinklers/constant/foam.inp
species
(
    air
);

reactions
{}
