openfoam2206/tutorials/lagrangian/reactingParcelFoam/liquidFilmStepWithSprinklers/constant/reactingCloud1Properties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      reactingCloud1Properties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         no;
    transient       yes;
    cellValueSourceCorrection no;
    maxCo           0.3;

    sourceTerms
    {
        schemes
        {
            rho             explicit 1;
            U               explicit 1;
            Yi              explicit 1;
            h               explicit 1;
            radiation       explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        thermo:mu       cell;
        T               cell;
        Cp              cell;
        kappa           cell;
        p               cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               analytical;
    }
}

constantProperties
{
    rho0            1000;
    T0              300;
    Cp0             4187;

    constantVolume  true;
}

subModels
{
    particleForces
    {
        sphereDrag;
        gravity;
    }

    injectionModels
    {
        model1
        {
            type            coneInjection;
            SOI             5.00;
            duration        10.00;
            positionAxis
            (
                ((-0.5 0.1 0.7) (1 0 -1))
                ((-0.5 0.2 0.7) (1 0 -1))
                ((-0.5 0.3 0.7) (1 0 -1))
                ((-0.5 0.4 0.7) (1 0 -1))
                ((-0.5 0.5 0.7) (1 0 -1))
                ((-0.5 0.6 0.7) (1 0 -1))
                ((-0.5 0.7 0.7) (1 0 -1))
                ((-0.5 0.8 0.7) (1 0 -1))
                ((-0.5 0.9 0.7) (1 0 -1))
            );

            massTotal       10;
            parcelsPerInjector 20000;
            parcelBasisType mass;
            flowRateProfile constant 1;
            Umag            constant 0.2;
            thetaInner      constant 0;
            thetaOuter      constant 55;

            sizeDistribution
            {
                type         RosinRammler;
                RosinRammlerDistribution
                {
                    minValue        5e-04;
                    maxValue        0.0012;
                    lambda          7.5e-05;
                    n               0.5;
                }
            }
        }
    }

    dispersionModel none;

    patchInteractionModel standardWallInteraction;

    heatTransferModel none;

    compositionModel singleMixtureFraction;

    phaseChangeModel none;

    devolatilisationModel none;

    surfaceReactionModel none;

    stochasticCollisionModel none;

    surfaceFilmModel thermoSurfaceFilm;

    radiation       off;

    standardWallInteractionCoeffs
    {
        type            rebound;
    }

    singleMixtureFractionCoeffs
    {
        phases
        (
            gas
            {
            }
            liquid
            {
                H2O         1;
            }
            solid
            {
            }
        );
        YGasTot0        0;
        YLiquidTot0     1;
        YSolidTot0      0;
    }

    thermoSurfaceFilmCoeffs
    {
        interactionType absorb;
        injectionOffset 5; // Times film thickness
        minDiameter     1e-4;
    }
}


cloudFunctions
{}


// ************************************************************************* //
